routes/web.php

select * from "categories" where "categories"."id" in (1, 2, 3, 4)
select * from "posts" order by "created_at" desc limit 9 offset 0
select count(*) as aggregate from "posts"
---
    return view('home', ['title' => 'Home Page']);
});

Route::get('/posts', function () {
    return view('posts', ['title' => 'Blog', 'posts' => Post::filter(request(['search', 'category', 'author']))->latest()->paginate(9)->withQueryString()]);
});